app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-12-28 21:11:51.508669"], ["updated_at", "2016-12-28 21:11:51.508669"]]
---
  def create
    @student = Student.create(post_params(:first_name, :last_name))